Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/E15A.tmx
Source language: en_us
Languages: zh_cn

source: 7 cheap and easy vegetarian meals
zh_cn: 七道实惠又简单的蔬菜类菜肴

source: Many of us lead busy lives and everyone, especially those of us with families, is trying to get dinner on the table as quickly and easily as possible.
zh_cn: 我们大多数人都过着一种忙碌的生活，每顿饭大家都尽可能地想快速、简单地解决掉，那些有家庭的人更是这样。

source: Occasionally we fall back on using prepackaged meals from the grocery store or calling for takeout.
zh_cn: 有时候会吃一些便利店里买来的方便食物或者是直接叫外卖。

source: Those meals have more fat, salt and sugar than we need, they produce a lot of garbage from the packaging and they are more expensive than cooking from scratch.
zh_cn: 这些食物通常都含有过多的脂肪、盐分和糖分，包装袋也会产生大量的垃圾，并不比我们自己做饭来得实惠。

source: In these uncertain economic times, we need to look at our food costs and start to spend more wisely.
zh_cn: 在经济状况不明朗的眼下，伙食费还是需要精打细算的。

source: Here are seven recipes that will cover your dinners for a week, with some leftovers for lunch.
zh_cn: 下面有七个菜谱可以让你一周的晚饭不重样，还包括午饭。

source: They are as quick as takeout, as easy as many processed dinners, and more economical and nutritious than either.
zh_cn: 做起来跟外卖一样的快，跟那些方便食品一样的简单，但要比它们更有营养、更实惠。

source: Chickpea Curry
zh_cn: 咖喱鹰嘴豆

source: My son eats a lot of tofu and I'm always encouraging him to add more legumes to his diet, so I decided on something with chickpeas.
zh_cn: 我儿子很喜欢吃豆腐，我也一直鼓励他多吃些豆类蔬菜，所以就决定用鹰嘴豆来试试。

source: I had in my mind a recipe from Julie Sahni's cookbook "Classic Indian Cooking" as a starting point and we made our own version.
zh_cn: 这个想法来自于Julie Sahni的烹饪书籍《经典印度菜》中的一个菜谱，但我要做出自己的特色。

source: I had some dried Mexican chilies that Hugh had brought from his store.
zh_cn: Hugh从他的店里帮我带回了一些墨西哥干红辣椒。

source: I've always rehydrated chilies, but Hugh put them in the bottom of a dry pan until they were fragrant, chopped them finely, added a bit of olive oil and then crushed them with a mortar and pestle until they made a paste.
zh_cn: 我通常都是把这些辣椒用水泡一下。但Hugh是先用平底锅将辣椒炝出香味，切好，加稍许的橄榄油，之后再捣碎成糊状。

source: We had some leftover rice and carrots from the night before and tossed them in as well.
zh_cn: 最后再将前一晚吃剩的米饭和胡萝卜一同加进去拌匀。

source: You could add vegetables such as zucchini or cauliflower as well.
zh_cn: 也可以加一些蔬菜，比如西葫芦或者是花菜。

source: Here is the full Chickpea Curry recipe.
zh_cn: 这里有完整的咖喱鹰嘴豆的菜谱。

source: Beans with Tomatoes and Swiss Ch?ard
zh_cn: 番茄加豆和甜菜

source: We actually ended up getting a number of meals from the Swiss chard I grew in my garden this summer, and I really enjoyed them.
zh_cn: 这个夏天我们时常用院子里种的甜菜做菜，我很喜欢吃。

source: I had a good handful to harvest and I cooked them up with some fresh tomatoes and mushrooms for a quick, throw-together meal that was easy and cheap.
zh_cn: 今年甜菜丰收，我就把它和新鲜的番茄、蘑菇一起做菜，既快、又简单实惠。

source: All the measurements are approximate, and you can easily put together other legumes such as chickpeas or lentils, or other leafy vegetables such as kale or spinach.
zh_cn: 用量随意，也可以加一些其他的豆类，像鹰嘴豆或小扁豆，又或者橄榄、菠菜之类的蔬菜。

source: You can eat this as is, in a bowl, or serve it over pasta or rice.
zh_cn: 可以直接盛在碗里享用，或者与米饭、面条一起拌着吃。

source: If you have any leftovers, you can eat them as a cold salad or add some liquid and puree it into a soup.
zh_cn: 吃剩下的可以用来做沙拉或者加些水做成汤。

source: Here are the step-by-step instructions for Beans with Tomatoes and Swiss Chard.
zh_cn: 下面有很详细的说明来制作番茄加豆和甜菜。

source: Vegetarian Chili
zh_cn: 蔬菜辣酱

source: If you feel like a party, invite a few friends over and make this easy, delicious chili.
zh_cn: 如果你想邀请几个朋友一起吃饭的话，可以试试这款简单又美味的辣酱。

source: Or better still, make it the day before and then you don't have to do anything but heat it up when your guests arrive.
zh_cn: 最好头一天就做好，吃的时候只需加热一下就可以了。

source: I looked at lots of recipes for vegetarian chili, but in the end I adapted my regular meat-based chili because I like the seasonings.
zh_cn: 在众多的素食辣酱的做法中，因为个人爱好，我选择了加肉的这种。

source: Without the meat to soak up the heat, I found the chili a bit too hot.
zh_cn: 如果没有肉来作为佐料的话，辣酱会稍微有点辣。

source: I have reduced the amount of dried chili peppers by quite a bit, so if you like your chili on the spicy side you could increase it.
zh_cn: 当然可以根据个人对“辣”的爱好来调整干辣椒粉的用量。

source: Use the list of vegetables as a guideline, and feel free to toss in whatever you have on hand.
zh_cn: 菜谱中有个所要用到的蔬菜清单，也可以随意使用手头上现成的东西。

source: I used kidney beans, but you could add some chickpeas or black beans, as well.
zh_cn: 我用的是四季豆，其他的像鹰嘴豆、黑豆也可以。

source: If you do want meat in the chili, brown 1 1/2 pounds of ground beef before you add the other ingredients.
zh_cn: 如果要加肉的话，就要在加入其他配料之前将大约1 1/2磅的绞碎了的牛肉煎成焦黄色，再一起加进去。

source: The rest of the tricks for Vegetarian Chili are in the recipe.
zh_cn: 这道蔬菜辣酱的其他的诀窍就在下面的菜谱中。

source: I have a confession to make.
zh_cn: 有件事情我要交代。

source: In an attempt to make lentils more palatable for my husband, I did something I've never done before.
zh_cn: 为了我老公觉得小扁豆吃起来很可口，我尝试了一下以前从未做过的事情。

source: I took a totally healthy vegetarian dish and added bacon.
zh_cn: 我加入了大量的健康蔬菜和培根。

source: Not just any bacon, but some magnificent pancetta that my son brought from the store he works in. It was just a bit, but enough to elevate this dish from nice to delicious.
zh_cn: 我还加了一些我儿子从他上班的店子里带回的一些非常美味的咸猪肉，用量虽然不多，但足以让这道菜变得更加美味可口。

source: Of course, you can always leave the bacon out.
zh_cn: 当然，你也可以不放培根。

source: Here is the full recipe for Oriecchiette with Lentils, Onion and Spinach.
zh_cn: 可以根据下面完整的菜谱来制作Oriecchiette with Lentils, Onion and Spinach。

source: Dal and Pumpkin Soup
zh_cn: 豆糊和南瓜汤

source: I'm a big fan of Nigel Slater and his book, "The Kitchen Diaries: A Year in the Kitchen," which encapsulates his theories about food and cooking.
zh_cn: 我是奈杰尔斯拉特的超级粉丝，很喜欢他的书《厨房日记：厨房中的一年》，这本书阐述了他的关于食物很烹饪的一些理念。

source: I turned to the very front of the book and decided to make his New Year's Day soup.
zh_cn: 我翻到这本书的最前页，打算做一道他的新年汤羹。

source: Slater apparently has a tradition of making soup on New Year's Day and I heartily approve.
zh_cn: 很显然斯拉特有在新年这一天做一道汤羹的习惯，对于这一点我坚决拥护。

source: He calls this "a bowl of soup that both whips and kisses."
zh_cn: 他把它叫做“充满热情和爱意的一碗汤”。

source: It seems like a pretty good meal to have as the weather gets colder, and we have the long winter before us.
zh_cn: 在漫长而又寒冷的冬日喝上一碗这样的汤是个非常好的选择。

source: All the details for whipping up Dal and Pumpkin Soup are in the recipe.
zh_cn: 快速做好豆糊和南瓜汤的所有细节都在下面的这个菜谱中。

source: Vegetable Salad: Carrots, Fennel, Radishes, Beets and Onion
zh_cn: 蔬菜沙拉胡萝卜、茴香、小萝卜、甜菜和洋葱

source: Earlier this year, I reviewed "Vegetable Harvest" by Patricia Wells.
zh_cn: 今年的早些时候，我又重新看了遍《蔬菜的收获》这本书，是由帕特里夏韦尔斯写的。

source: This lovely winter salad was the first recipe I tried from the book.
zh_cn: 这本书里我最想尝试的就是美味的冬季沙拉。

source: I had just been to the farmers' market and bought an enormous bunch of radishes for 50 cents, so this recipe seemed fortuitous.
zh_cn: 我刚好在农贸市场花了50美分买了很多的小萝卜，可以用来做这道沙拉。

source: You could serve this either as part of a family meal, or as a first course at a dinner party.
zh_cn: 可以把它作为家常菜，也可以作为宴会上的开胃菜。

source: It is quite colourful and attractive on the plate-and is really tasty.
zh_cn: 这道菜颜色非常鲜艳，看上去就很非常地有食欲。

source: Whip up a lovely Vegetable Salad: Carrots, Fennel, Radishes, Beets and Onion using the recipe.
zh_cn: 快速做好美味的蔬菜沙拉：胡萝卜、茴香、小萝卜、甜菜和洋葱的菜谱就在下面的链接中。

source: Mushroom Tofu Stew
zh_cn: 蘑菇炖豆腐

source: Big chunks of meat and potatoes are usually what come to mind when you think about stew.
zh_cn: 提起炖菜，你通常都会想起大块的肉和土豆。

source: But many university students either don't have the money or the inclination to eat that kind of meal.
zh_cn: 但是很多的大学生没有钱或不愿意吃这种炖菜。

source: I was looking for something that was vegetarian and would be hearty and nourishing while still being easy on the pocket book.
zh_cn: 因此我一直想尝试做一种蔬菜类的、即丰盛又有营养且很方便的一道炖菜。

source: And like all of the recipes in this series, you have to be able to make it all in one pot.
zh_cn: 当然像其他所有的菜谱一样，所有的材料必须要放在一个锅里来炖。

source: This recipe fulfills all of those requirements, but, while delicious, I will freely admit that it isn't the most beautiful dish I've ever made.
zh_cn: 下面的这个菜谱满足了以上的所有要求，并且做出来的菜很美味。同时我也承认这道菜并不是我做过的最好的一道。

source: Make Mushroom Tofu Stew using the recipe.
zh_cn: 制作蘑菇炖豆腐的菜谱在下面的链接中。
